In [10]:
from env import host, user, password
%matplotlib inline
import pandas as pd
import numpy as np

np.random.seed(123)

In [11]:
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
           'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

In [12]:
# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [13]:
df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [14]:
df_num1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df_num2 = pd.DataFrame([[1, 2, 3], [4, 5, 6]])

In [15]:
da = np.array([[1, 2, 3], [4, 5, 6]])
pd.DataFrame(da, columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6

In [16]:
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [17]:
query = '''
SELECT *
FROM employees'''

In [18]:
pd.read_sql(query, url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]